"common.ok" = "OK";
"common.cancel" = "Cancel";
"common.save" = "Save";
"common.done" = "Done";
"common.na" = "N/A";
"app.language" = "app.language";

"language.section" = "Language";
"language.system" = "System";
"language.english" = "English";
"language.russian" = "Russian";

"panel.title" = "UAV Digital Twin Simulator";
"panel.keyboard_hint" = "WASD/QE fly, Shift boost, 1..5 cameras, arrows FPV look, +/- zoom";
"panel.workflow_hint" = "Main controls are in the top toolstrip. Use toolbar buttons to show or hide parameters.";
"panel.toggle_collapse" = "Collapse/Expand Control Panel";
"panel.collapse" = "Collapse Panel";
"panel.expand" = "Expand Panel";
"panel.parameters.on" = "Parameters: On";
"panel.parameters.off" = "Parameters: Off";
"panel.hide" = "Hide parameters panel";
"panel.show" = "Show parameters panel";
"panel.drone_profile" = "UAV Profile";
"panel.model" = "Model";
"panel.mass" = "Mass";
"panel.max_flight" = "Max flight";
"panel.max_wind" = "Wind resistance";
"panel.camera_layout" = "Camera layout";
"panel.visual_class" = "Visual class";
"panel.commands" = "Commands";
"panel.position" = "Position";
"panel.orientation" = "Orientation";
"panel.throttle" = "Throttle";
"panel.camera" = "Camera";
"panel.camera_mode" = "Camera mode";
"panel.weather" = "Weather";
"panel.terrain" = "Terrain";
"panel.diagnostics" = "Diagnostics";
"panel.fleet" = "Fleet";
"panel.damage" = "Damage & Health";
"panel.warnings" = "Warnings";
"panel.telemetry" = "Telemetry";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Roll";
"axis.pitch" = "Pitch";
"axis.yaw" = "Yaw";

"camera.mode.free" = "Free";
"camera.mode.follow" = "Tail / Chase";
"camera.mode.third_person" = "Third Person";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Orbit";
"camera.mode.top" = "Top";
"camera.mode.top_down" = "Top Down";
"camera.fov" = "FOV";
"camera.sensitivity" = "Sensitivity";
"camera.smoothing" = "Smoothing";
"camera.orbit_distance" = "Orbit distance";
"camera.follow_x" = "Follow offset X";
"camera.follow_y" = "Follow offset Y";
"camera.follow_z" = "Follow offset Z";
"camera.fpv_stabilization" = "FPV stabilization";
"camera.fpv_shake" = "FPV shake";

"command.reset" = "Reset";
"command.takeoff" = "Takeoff";
"command.land" = "Land";
"command.hover" = "Hover";
"command.auto_path" = "Auto Path";
"command.return_home" = "Return Home";
"command.emergency_stop" = "Emergency Stop";
"command.start_animation" = "Start Simulation";
"command.stop_animation" = "Stop Simulation";

"weather.normal" = "Normal";
"weather.wind" = "Wind";
"weather.rain" = "Rain";
"weather.snow" = "Snow";
"weather.fog" = "Fog";
"weather.smog" = "Smog";
"weather.thunderstorm" = "Thunderstorm";
"weather.intensity" = "Intensity";
"weather.wind_direction" = "Wind direction";
"weather.wind_speed" = "Wind speed";
"weather.gusts" = "Gusts";

"terrain.grid_demo" = "Grid Demo";
"terrain.field" = "Field";
"terrain.forest" = "Forest";
"terrain.city" = "City";
"terrain.density" = "Object density";
"terrain.seed" = "Seed";
"terrain.scale" = "Map scale";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"environment.boundary_barrier_visible" = "Show boundary barrier";

"diagnostic.mode" = "Diagnostic mode";
"diagnostic.mode.normal" = "Normal view";
"diagnostic.mode.thermal" = "Thermal / Load";
"diagnostic.mode.damage" = "Damage / Integrity";
"diagnostic.collision_debug" = "Collision debug";
"diagnostic.fleet_mode" = "Enable fleet";

"fleet.formation" = "Formation";
"fleet.mode.off" = "Off";
"fleet.mode.line" = "Line";
"fleet.mode.triangle" = "Triangle";
"fleet.separation" = "Separation";
"fleet.wingmen" = "Wingmen";
"fleet.risk" = "Inter-drone risk";
"fleet.nearest" = "Nearest separation";

"damage.reset" = "Reset damage";
"damage.clear_selection" = "Clear selection";
"damage.hide" = "Hide";

"component.battery" = "Battery";
"component.gimbal" = "Front camera / gimbal";
"component.fc_core" = "Flight controller core";
"component.motor_fl" = "Motor FL";
"component.motor_fr" = "Motor FR";
"component.motor_rl" = "Motor RL";
"component.motor_rr" = "Motor RR";
"component.propeller_fl" = "Propeller FL";
"component.propeller_fr" = "Propeller FR";
"component.propeller_rl" = "Propeller RL";
"component.propeller_rr" = "Propeller RR";
"component.arm_fl" = "Arm FL";
"component.arm_fr" = "Arm FR";
"component.arm_rl" = "Arm RL";
"component.arm_rr" = "Arm RR";
"component.esc_power" = "ESC / power electronics";

"warning.nominal" = "OK";
"warning.warning" = "Warn";
"warning.critical" = "Crit";
"warning.collision_high" = "High collision risk";
"warning.weather_severe" = "Severe weather conditions";
"warning.battery_low" = "Low battery";
"warning.integrity_low" = "Structural integrity low";
"warning.fixedwing_low_speed" = "Fixed-wing low-speed / stall risk";
"warning.fleet_risk" = "Fleet separation risk";
"warning.interdrone_critical" = "Critical inter-drone proximity";
"warning.emergency" = "Emergency mode active";
"warnings.none" = "No active warnings";
"summary.damage.none" = "No critical damage";

"signal_loss.warning" = "Signal will be lost in %d...";
"signal_loss.lost_title" = "Signal lost";
"signal_loss.lost_message" = "The UAV has left the map bounds. Flight controls are locked until the signal is restored.";
"signal_loss.recover" = "Restore signal";

"telemetry.position" = "Position";
"telemetry.velocity" = "Velocity";
"telemetry.attitude" = "Attitude";
"telemetry.speed" = "Speed";
"telemetry.throttle" = "Throttle";
"telemetry.mode" = "Mode";
"telemetry.state" = "State";
"telemetry.battery" = "Battery";
"telemetry.power" = "Power draw";
"telemetry.remaining" = "Remaining time";
"telemetry.weather" = "Weather";
"telemetry.collision_risk" = "Collision risk";
"telemetry.nearest_obstacle" = "Nearest obstacle";
"telemetry.emergency" = "Emergency action";
"telemetry.damage" = "Damage";
"telemetry.thermal" = "Thermal";
"telemetry.fleet" = "Fleet mode";
"telemetry.fleet_risk" = "Fleet risk";
"telemetry.nearest_interdrone" = "Nearest inter-drone";
"telemetry.export" = "Export Telemetry";
"telemetry.export.success" = "Telemetry exported";
"telemetry.export.failure" = "Telemetry export failed";

"hud.title" = "Telemetry HUD";
"hud.telemetry" = "Telemetry";
"hud.camera" = "Camera";
"hud.drone" = "Drone";

"mode.manual" = "Manual";
"mode.auto_path" = "Auto Path";
"mode.return_home" = "Return Home";
"mode.hover" = "Hover";
"mode.emergency_stop" = "Emergency Stop";
"mode.takeoff" = "Takeoff";
"mode.landing" = "Landing";

"flight_state.on_ground" = "On ground";
"flight_state.battery_depleted" = "Battery depleted";
"flight_state.ascending" = "Ascending";
"flight_state.descending" = "Descending";
"flight_state.emergency" = "Emergency";
"flight_state.stable" = "Stable";
"flight_state.climbing" = "Climbing";
"flight_state.cruise" = "Cruise";

"emergency.none" = "None";
"emergency.slow_down" = "Slow down";
"emergency.hover" = "Hover";
"emergency.avoid" = "Avoid";
"emergency.stop" = "Emergency stop";

"battery.depleted.title" = "Battery depleted";
"battery.depleted.message" = "Battery is fully depleted. Choose how to continue simulation.";
"battery.depleted.charge" = "Charge drone";
"battery.depleted.restart" = "Restart scenario";

"abstract.edit" = "Edit Parameters";
"abstract.editor.title" = "Abstract UAV Parameters";
"abstract.editor.mass" = "Mass";
"abstract.editor.dimensions" = "Dimensions";
"abstract.editor.energy" = "Energy and Limits";
"abstract.editor.control" = "Control";
"abstract.validation.vertical" = "Ascent/descent speeds are too low.";
"abstract.validation.speed" = "Horizontal speed must be >= ascent/descent speeds.";
"abstract.validation.radius" = "Collision radius is too large for selected dimensions.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Abstract UAV";

"drone.visual.mini" = "Light compact quadcopter";
"drone.visual.vector" = "Mid-size dual-camera quadcopter";
"drone.visual.atlas" = "Larger professional quadcopter";
"drone.visual.abstract" = "Custom abstract profile";

"drone.camera.single_compact" = "Single compact front gimbal";
"drone.camera.dual_front" = "Dual front camera module";
"drone.camera.triple_front" = "Triple front camera module";
"drone.camera.custom" = "Custom editable camera module";

"ui.toggle_telemetry_hud" = "Toggle compact telemetry HUD";

"camera.zoom_sensitivity" = "Zoom sensitivity";
"camera.free_speed" = "Free camera speed";
"camera.distance" = "Camera distance";
"camera.fpv_yaw_limit" = "FPV yaw limit";
"camera.fpv_pitch_limit" = "FPV pitch limit";
"camera.fpv_near_clip" = "FPV near clip";
"camera.fpv_mount_x" = "FPV mount X";
"camera.fpv_mount_y" = "FPV mount Y";
"camera.fpv_mount_z" = "FPV mount Z";
"camera.fpv_hide_obstructing" = "Hide obstructing drone parts in FPV";

"keybind.section.title" = "Key bindings";
"keybind.open" = "Bindings";
"keybind.category.flight" = "Flight controls";
"keybind.category.camera" = "Camera controls";
"keybind.category.ui" = "UI controls";
"keybind.category.debug" = "Debug / overlays";
"keybind.flight.forward" = "Forward";
"keybind.flight.backward" = "Backward";
"keybind.flight.left" = "Left";
"keybind.flight.right" = "Right";
"keybind.flight.descend" = "Descend";
"keybind.flight.ascend" = "Ascend";
"keybind.flight.yaw_left" = "Yaw left";
"keybind.flight.yaw_right" = "Yaw right";
"keybind.flight.accelerate" = "Accelerate";
"keybind.flight.hover" = "Hover / stabilize";
"keybind.flight.reset" = "Reset drone";
"keybind.camera.mode1" = "Camera 1 (Free)";
"payload.select" = "Payload Selection";
"payload.placeholder.message" = "This function will be added later.";
"control_mode.angle" = "Angle";
"command.arm" = "Arm";
"command.disarm" = "Disarm";
"telemetry.arm_state" = "Arm state";
"arm_state.armed" = "Armed";
"arm_state.disarmed" = "Disarmed";
"flight_state.disarmed" = "Disarmed";
"flight_state.armed_idle" = "Armed Idle";
"flight_state.crashed" = "Crashed";
"warning.disarmed" = "Aircraft is disarmed";
"warning.integrity_critical" = "Critical structural damage";
"warning.crashed" = "Aircraft crashed";
"damage.severity.nominal" = "Nominal";
"damage.severity.light" = "Light";
"damage.severity.medium" = "Medium";
"damage.severity.critical" = "Critical";
"keybind.camera.mode2" = "Camera 2 (Chase)";
"keybind.camera.mode3" = "Camera 3 (Orbit)";
"keybind.camera.mode4" = "Camera 4 (FPV)";
"keybind.camera.mode5" = "Camera 5 (Top)";
"keybind.camera.toggle_fpv" = "Toggle FPV";
"keybind.camera.cycle_mode" = "Cycle camera mode";
"keybind.camera.zoom_in" = "Zoom in";
"keybind.camera.zoom_out" = "Zoom out";
"keybind.camera.yaw_left" = "Yaw left (camera)";
"keybind.camera.yaw_right" = "Yaw right (camera)";
"keybind.camera.pitch_up" = "Pitch up (camera)";
"keybind.camera.pitch_down" = "Pitch down (camera)";
"keybind.camera.reset_orientation" = "Reset camera orientation";
"workspace.toolstrip" = "Toolstrip";
"toolstrip.tab.simulation" = "Simulation";
"toolstrip.tab.flight" = "Flight";
"toolstrip.tab.camera" = "Camera";
"toolstrip.tab.environment" = "Environment";
"toolstrip.tab.debug" = "Debug";
"toolstrip.tab.projects" = "Projects";
"toolstrip.section.run" = "Run Control";
"toolstrip.section.flight_model" = "Airframe & Control";
"toolstrip.section.throttle" = "Throttle";
"toolstrip.section.camera_modes" = "Camera Modes";
"toolstrip.section.camera_quick" = "Camera Presets";
"toolstrip.section.weather" = "Weather";
"toolstrip.section.terrain" = "Terrain";
"toolstrip.section.debug" = "Diagnostics";
"toolstrip.section.projects" = "Project Actions";
"camera.zoom_in" = "Zoom +";
"camera.zoom_out" = "Zoom -";
"camera.reset_orientation" = "Reset View";
"panel.collision_debug" = "Collision Debug";
"window.fullscreen" = "Fullscreen";
"keybind.ui.toggle_panel" = "Collapse / expand panel";
"keybind.ui.toggle_hud" = "Toggle telemetry HUD";
"keybind.debug.toggle_damage" = "Toggle damage overlay";
"keybind.debug.toggle_thermal" = "Toggle thermal overlay";
"keybind.capture.idle" = "Select an action and press Rebind.";
"keybind.capture.prompt" = "Press a key for \"%@\" (Esc to cancel)";
"keybind.rebind" = "Rebind";
"keybind.capturing" = "Listening…";
"keybind.reset_defaults" = "Reset Defaults";

"control_mode.title" = "Flight control mode";
"control_mode.stabilized" = "Stabilized";
"control_mode.acro" = "Acro";
"control_mode.hover_assist" = "Hover Assist";

"common.export" = "Export";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset To Preset";
"camera.advanced" = "Advanced Camera";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Active particles";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame";
"telemetry.physics_time" = "Physics";
"telemetry.render_time" = "Render";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.visual.fixed_rect" = "Rectangular fixed-wing";
"drone.visual.fixed_delta" = "Delta fixed-wing";
"drone.visual.fixed_swept" = "Swept fixed-wing";
"drone.camera.fixed_front" = "Fixed front camera";

"menu.title" = "UAV Projects";
"menu.saved_projects" = "Saved Projects";
"menu.create_project" = "Create Project";
"menu.recent_project" = "Recent Project";
"menu.search" = "Search project";
"menu.sort" = "Sort";

"project.name" = "Project name";
"project.sort.newest" = "Newest";
"project.sort.name" = "Name";
"project.sort.recent" = "Recently Opened";
"project.create.title" = "Create Project";
"project.create.action" = "Create";
"project.open.action" = "Open Project Browser";
"project.open.failure" = "Failed to open project";
"project.save.action" = "Save Project";
"project.save_as.action" = "Save Project As";
"project.save_as.title" = "Save Project As";
"project.save_as.action" = "Save As";
"project.save.success" = "Project saved";
"project.save.failure" = "Project save failed";
"project.duplicate.title" = "Duplicate Project";
"project.duplicate.action" = "Duplicate Project";
"project.duplicate.success" = "Project duplicated";
"project.duplicate.failure" = "Project duplication failed";
"project.delete.action" = "Delete Project";
"project.delete.failure" = "Failed to delete project";
"project.delete.confirm.title" = "Delete Project";
"project.delete.confirm.message" = "Delete project '%@'?";

"project.unsaved.title" = "Unsaved Changes";
"project.unsaved.message" = "Do you want to save project '%@'?\nUnsaved changes may be lost.";
"project.unsaved.save" = "Save";
"project.unsaved.save_exit" = "Save and Exit";
"project.unsaved.exit_without" = "Exit Without Saving";

"telemetry.export.select_folder" = "Choose export folder for telemetry file.";
"control_mode.acro" = "Acro / Rate";
"control_mode.hover_assist" = "Hover / Alt-Hold";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset to preset";
"camera.advanced" = "Advanced Camera";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Particle count";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame time";
"telemetry.physics_time" = "Physics update";
"telemetry.render_time" = "Render update";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Active objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.model.ebee_class" = "eBee-class Mapping UAV";
"drone.model.ux11_class" = "UX11-class Survey UAV";
"drone.model.wingtra_class" = "Wingtra-class VTOL UAV";
"drone.model.trinity_class" = "Trinity-class Pro UAV";

"drone.visual.fixed_rect" = "Fixed-wing rectangular family";
"drone.visual.fixed_delta" = "Fixed-wing delta family";
"drone.visual.fixed_swept" = "Fixed-wing swept family";
"drone.visual.ebee_class" = "Tailless flying-wing mapping platform";
"drone.visual.ux11_class" = "Conventional survey fixed-wing platform";
"drone.visual.wingtra_class" = "Tailsitter VTOL fixed-wing platform";
"drone.visual.trinity_class" = "Professional survey eVTOL platform";

"drone.camera.fixed_front" = "Fixed-wing front camera";

"common.not_specified" = "Not specified";

"country.china" = "China";
"country.united_states" = "United States";
"country.norway" = "Norway";
"country.switzerland" = "Switzerland";
"country.germany" = "Germany";
"country.israel" = "Israel";
"country.poland" = "Poland";
"country.canada" = "Canada";
"country.user_defined" = "User Defined";

"uav.filter.type" = "Type";
"uav.filter.mass" = "Mass";
"uav.filter.vehicle.all" = "All";
"uav.filter.vehicle.multicopters" = "Multicopters";
"uav.filter.vehicle.helicopters" = "Helicopters";
"uav.filter.vehicle.fixed_wing" = "Fixed-Wing";
"uav.filter.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.filter.mass.all" = "All";
"uav.filter.mass.nano" = "Nano";
"uav.filter.mass.micro" = "Micro";
"uav.filter.mass.light" = "Light";
"uav.filter.mass.medium" = "Medium";
"uav.filter.mass.heavy" = "Heavy";

"uav.vehicle.multicopter" = "Multicopter";
"uav.vehicle.fixed_wing" = "Fixed-Wing";
"uav.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.vehicle.helicopter" = "Helicopter";
"uav.vehicle.custom" = "Custom";

"uav.mass.nano" = "Nano";
"uav.mass.micro" = "Micro";
"uav.mass.light" = "Light";
"uav.mass.medium" = "Medium";
"uav.mass.heavy" = "Heavy";
"uav.mass.custom" = "Custom";

"uav.spec.verified" = "Verified";
"uav.spec.partial" = "Partial";
"uav.spec.custom" = "Custom";

"uav.badge.custom" = "CUSTOM";
"uav.catalog.title" = "UAV Catalog";
"uav.catalog.empty" = "No UAV profiles match the current filters.";
"uav.catalog.edit_abstract" = "Edit Abstract UAV";
"uav.catalog.selected_outside_filter" = "Selected model is outside current filter";

"uav.card.title" = "Selected UAV";
"uav.card.manufacturer" = "Manufacturer";
"uav.card.country" = "Country";
"uav.card.type" = "Type";
"uav.card.mass_class" = "Mass class";
"uav.card.base_mass" = "Base mass";
"uav.card.max_payload" = "Max payload";
"uav.card.mtow" = "MTOW";
"uav.card.role" = "Role";
"uav.card.status" = "Status";
"uav.card.armament_note" = "Armament note";
"uav.card.empty" = "No selected UAV profile";

"uav.manufacturer.custom" = "Custom";

"uav.profile.abstract-uav.display_name" = "Abstract UAV";
"uav.profile.dji-matrice-350-rtk.short_description" = "Enterprise quadcopter with landing gear, central gimbal bay, and modular payload support.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Enterprise inspection, mapping, and public-safety operations";
"uav.profile.dji-flycart-30.short_description" = "Heavy cargo multicopter with coaxial lift groups and a central underslung freight bay.";
"uav.profile.dji-flycart-30.mission_role" = "Cargo transport and logistics";
"uav.profile.dji-mavic-4-pro.short_description" = "Foldable consumer camera multicopter with a triple-camera forward gimbal section.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Consumer aerial imaging and creator capture";
"uav.profile.dji-neo.short_description" = "Ultra-compact protected-prop multicopter designed as a lightweight personal flying camera.";
"uav.profile.dji-neo.mission_role" = "Personal aerial video capture";
"uav.profile.dji-phantom-3-standard.short_description" = "Classic Phantom consumer quadcopter with integrated landing gear and a front gimbal camera bay.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Consumer aerial imaging";
"uav.profile.freefly-alta-x.short_description" = "Heavy-lift open-frame cinema and industrial multirotor with a central underslung payload section.";
"uav.profile.freefly-alta-x.mission_role" = "Heavy-lift cinema and industrial payload carriage";
"uav.profile.griff-30.short_description" = "Heavy-lift cargo UAV with a large transport frame and an underslung load zone.";
"uav.profile.griff-30.mission_role" = "Heavy-lift cargo transport";
"uav.profile.griff-60.short_description" = "Large heavy-lift cargo UAV with a higher-capacity airframe than Griff 30.";
"uav.profile.griff-60.mission_role" = "Heavy-lift cargo transport";
"uav.profile.avidrone-490tl.short_description" = "Tandem-rotor cargo UAV with a long central fuselage and underslung freight position.";
"uav.profile.avidrone-490tl.mission_role" = "Cargo transport and utility lift";
"uav.profile.wingtraone-gen-ii.short_description" = "Hybrid VTOL mapping aircraft with a belly survey compartment and fixed-wing cruise layout.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Survey mapping and photogrammetry";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Long-span eVTOL survey aircraft with a central sensor compartment under the fuselage.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Survey mapping and corridor inspection";
"uav.profile.mq-9b-skyguardian.short_description" = "Large MALE fixed-wing platform with long wings, nose sensor architecture, and multi-hardpoint payload capacity.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Long-endurance ISR and multi-mission patrol";
"uav.profile.hermes-900.short_description" = "Multi-role MALE UAV with a long wing, pusher layout, and sensor stations under the nose and fuselage.";
"uav.profile.hermes-900.mission_role" = "Multi-role MALE ISR and maritime patrol";
"uav.profile.ft5-los.short_description" = "Twin-engine tactical fixed-wing platform with a compact surveillance airframe and modular payload integration.";
"uav.profile.ft5-los.mission_role" = "Tactical reconnaissance and ISTAR";
"uav.profile.flyeye.short_description" = "Lightweight fixed-wing observation UAV with a compact fuselage and underbelly electro-optical payload zone.";
"uav.profile.flyeye.mission_role" = "Close-range reconnaissance and observation";
"uav.profile.abstract-uav.short_description" = "User-defined custom UAV profile kept for future parameter tuning.";
"uav.profile.abstract-uav.mission_role" = "User-defined custom mission";

"telemetry.path_status" = "Path status";
"telemetry.path_status.idle" = "Idle";
"telemetry.path_status.valid" = "Valid";
"telemetry.path_status.recomputing" = "Recomputing";
"telemetry.path_status.blocked" = "Blocked";
"telemetry.waypoint" = "Waypoint";
"telemetry.waypoint.value" = "idx %d, left %d";
"telemetry.path_remaining" = "Path remaining";
